In [1]:
 # pip install mysql-connector-python

In [2]:
import mysql.connector

In [3]:
mydb = mysql.connector.connect(host="localhost",user="root",password="poonam123",database='classicmodels',use_pure=True)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000000044EF462D0>

In [4]:
mycursor.execute("DROP DATABASE my_db")

NameError: name 'mycursor' is not defined

In [5]:
# Create Database

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="poonam123"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE MYDB")

In [6]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('classicmodels',)
('hello',)
('india',)
('information_schema',)
('my_db',)
('mydata',)
('mydatabase',)
('mydb',)
('mysql',)
('performance_schema',)
('practice',)
('practice1',)
('procedures',)
('sys',)
('team',)

In [7]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="poonam123",
  database="MYDB",
use_pure=True)
mydb

### Creating a Table
To create a table in MySQL, use the "CREATE TABLE" statement.

In [8]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

### Check if Table Exists
check if a table exist by listing all tables in database with the "SHOW TABLES" statement

In [9]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

('customers',)

### Primary Key
When creating a table, create a column with a unique key for each record.

This can be done by defining a PRIMARY KEY.

We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.

In [10]:
# mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")
# Table already exists

In [11]:
#Create primary key on an existing table
mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

###  Insert Into Table
To fill a table in MySQL, use the "INSERT INTO" statement.

In [12]:
#Insert a record in the "customers" table

sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

**mydb.commit() -> It is required to make the changes, otherwise no changes are made to the table.**

### Insert Multiple Rows
To insert multiple rows into a table, use the executemany() method.

The second parameter of the executemany() method is a list of tuples, containing the data you want to insert

In [13]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

In [14]:
# Insert one row, and return the ID
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("Michelle", "Blue Village")
mycursor.execute(sql, val)

mydb.commit()

print("1 record inserted, ID:", mycursor.lastrowid)

#If we insert more than one row, the id of the last inserted row is returned

1 record inserted, ID: 15

### Select From a Table
To select from a table in MySQL, use the "SELECT" statement

In [15]:
# Select all records from the "customers" table, and display the result

mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall() # fetchall() method fetches all rows from the last executed statement

for x in myresult:
    print(x)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Michelle', 'Blue Village', 15)

### Selecting Columns
To select only some of the columns in a table, use the "SELECT" statement followed by the column name(s)

In [16]:
mycursor.execute("SELECT name, address FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)
    
# print(myresult)

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Michelle', 'Blue Village')

### fetchone() Method
If you are only interested in one row, you can use the fetchone() method.

The fetchone() method will return the first row of the result

In [17]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchone()

print(myresult)

('John', 'Highway 21', 1)

### Where

In [18]:
# Select record(s) where the address is "Park Lane 38"
import mysql.connector

# Assuming you have already defined your connection parameters
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="poonam123",
    database="MYDB"
)

mycursor = mydb.cursor()
sql = "SELECT * FROM customers WHERE address ='Park Lane 38' "

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Ben', 'Park Lane 38', 11)

### Wildcard Characters
select the records that starts, includes, or ends with a given letter or phrase.

Use the %  to represent wildcard characters

In [19]:
# Select records where the address contains the word "way"

sql = "SELECT * FROM customers WHERE address LIKE '%way%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Highway 21', 1)
('Susan', 'One way 98', 9)
('Viola', 'Sideway 1633', 14)

In [20]:
sql = "SELECT * FROM customers WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Vicky', 'Yellow Garden 2', 10)

### Order by

#### Sort the Result
Use the ORDER BY statement to sort the result in ascending or descending order.

The ORDER BY keyword sorts the result ascending by default. To sort the result in descending order, use the DESC keyword.

In [21]:
mycursor = mydb.cursor()

sql = "SELECT * FROM customers ORDER BY name"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Amy', 'Apple st 652', 3)
('Ben', 'Park Lane 38', 11)
('Betty', 'Green Grass 1', 7)
('Chuck', 'Main Road 989', 13)
('Hannah', 'Mountain 21', 4)
('John', 'Highway 21', 1)
('Michael', 'Valley 345', 5)
('Michelle', 'Blue Village', 15)
('Peter', 'Lowstreet 4', 2)
('Richard', 'Sky st 331', 8)
('Sandy', 'Ocean blvd 2', 6)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Viola', 'Sideway 1633', 14)
('William', 'Central st 954', 12)

In [22]:
mycursor = mydb.cursor()

sql = "SELECT * FROM customers ORDER BY name DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('William', 'Central st 954', 12)
('Viola', 'Sideway 1633', 14)
('Vicky', 'Yellow Garden 2', 10)
('Susan', 'One way 98', 9)
('Sandy', 'Ocean blvd 2', 6)
('Richard', 'Sky st 331', 8)
('Peter', 'Lowstreet 4', 2)
('Michelle', 'Blue Village', 15)
('Michael', 'Valley 345', 5)
('John', 'Highway 21', 1)
('Hannah', 'Mountain 21', 4)
('Chuck', 'Main Road 989', 13)
('Betty', 'Green Grass 1', 7)
('Ben', 'Park Lane 38', 11)
('Amy', 'Apple st 652', 3)

### Delete Record
You can delete records from an existing table by using the "DELETE FROM" statement:

In [23]:
#Delete any record where the address is "Mountain 21"

sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

**The WHERE clause specifies which record(s) that should be deleted. If you omit the WHERE clause, all records will be deleted!**

In [24]:
#scape values by using the placeholder %s method

mycursor = mydb.cursor()

sql = "DELETE FROM customers WHERE address = %s"
adr = ("Yellow Garden 2", )

mycursor.execute(sql, adr)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

### Delete a Table
You can delete an existing table by using the "DROP TABLE" statement:

In [ ]:
#Delete the table "customers"

sql = "DROP TABLE customers"

mycursor.execute(sql)

### Drop Only if Exist
If the table you want to delete is already deleted, or for any other reason does not exist, you can use the IF EXISTS keyword to avoid getting an error.

In [ ]:
# Delete the table "customers" if it exists

sql = "DROP TABLE IF EXISTS customers"

mycursor.execute(sql)

### Update Table
You can update existing records in a table by using the "UPDATE" statement

In [ ]:
# Overwrite the address column from "Valley 345" to "Canyon 123"

sql = "UPDATE customers SET address = 'Canyon 123' WHERE address = 'Valley 345'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

### Limit the Result
You can limit the number of records returned from the query, by using the "LIMIT" statement

In [ ]:
# Select the 5 first records in the "customers" table

mycursor.execute("SELECT * FROM customers LIMIT 5")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

### Start From Another Position
If you want to return five records, starting from the third record, you can use the "OFFSET" keyword

In [ ]:
# Start from position 3, and return 5 records

mycursor.execute("SELECT * FROM customers LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

### Join Two or More Tables
You can combine rows from two or more tables, based on a related column between them, by using a JOIN statement.

Consider you have a "users" table and a "products" table

In [ ]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE users (id INT, name VARCHAR(255), fav VARCHAR(255))")

sql = "INSERT INTO users (id, name) VALUES (%s, %s)"
val = [
  { id: 1, name: 'John', fav: 154},
{ id: 2, name: 'Peter', fav: 154},
{ id: 3, name: 'Amy', fav: 155},
{ id: 4, name: 'Hannah', fav:},
{ id: 5, name: 'Michael', fav:}
]

mycursor.executemany(sql, val)

mydb.commit()

mycursor.execute("SELECT * FROM users")

myresult = mycursor.fetchall() # fetchall() method fetches all rows from the last executed statement

for x in myresult:
    print(x)

In [ ]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE products (id INT, name VARCHAR(255))")

sql = "INSERT INTO users (id, name) VALUES (%s, %s)"
val = [{ id: 154, name: 'Chocolate Heaven' },
{ id: 155, name: 'Tasty Lemons' },
{ id: 156, name: 'Vanilla Dreams' }]

mycursor.executemany(sql, val)

mydb.commit()

mycursor.execute("SELECT * FROM products")

myresult = mycursor.fetchall() # fetchall() method fetches all rows from the last executed statement

for x in myresult:
    print(x)

### Join / Inner Join

In [ ]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

### LEFT JOIN

In [ ]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  LEFT JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

### RIGHT JOIN

In [ ]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  RIGHT JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
    print(x)